modify diagrams
